
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокИдентификаторовСтрок.ЗагрузитьЗначения(Параметры.МассивИдентификаторовСтрок);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ПолучитьТаблицуМетаданныхНаСервере();

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти


#Область ОбработчикиКомандФормы

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьТаблицуМетаданныхНаСервере()

	Для Каждого Стр Из СписокИдентификаторовСтрок Цикл
		
		ЭлементТОМ = ВладелецФормы.ДеревоОбъектовМетаданных.НайтиПоИдентификатору(Стр.Значение);
		
		МенеджерОбъектаМетаданных = НеОпределено;
		Выполнить("МенеджерОбъектаМетаданных = " + ЭлементТОМ.ИмяМетаданных);
		
		ВыборкаЭлементовПО = МенеджерОбъектаМетаданных[ЭлементТОМ.Имя].Выбрать();
		
//		Пока ВыборкаЭлементовПО.Следующий() Цикл
//			
//			ИсторияДанных.ЗаписатьВерсию(ВыборкаЭлементовПО.ПолучитьОбъект(), ТекущаяДата(),  ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор , ПользователиИнформационнойБазы.ТекущийПользователь().Имя, ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя, ВидИзмененияДанных.Добавление, "Первая версия", "Первая версия", НеОпределено);
//			
//		КонецЦикла
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти