
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ссылка") Тогда
		
		П = Новый Структура("Данные", Параметры.Ссылка);
		
		ТЗ = ИсторияДанных.ВыбратьВерсии(П, "НомерВерсии, Дата, ПредставлениеДанных","Дата Возр");
		
		Для Каждого Стр Из ТЗ Цикл
			
			НовСтр = Версии.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			
		КонецЦикла;		
		
	Иначе
		
		//ИмяМетаданныхЕЧ = Параметры.ИмяМетаданныхЕЧ;
		ИмяМетаданных   = Параметры.ИмяМетаданных;
		Имя             = Параметры.Имя;
		
		
		П = Новый Структура("Метаданные", Метаданные[ИмяМетаданных][Имя]);
		
		ТЗ = ИсторияДанных.ВыбратьВерсии(П, "НомерВерсии, Дата, ПредставлениеДанных","Дата Возр");
		
		Для Каждого Стр Из ТЗ Цикл
			
			НовСтр = Версии.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			
		КонецЦикла;
		
		//ЭлементТОМ.КоличествоВерсий = ТЗ.Количество();
		
	КонецЕсли;

КонецПроцедуры
