

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Лев(ИмяФормы,9) = "Обработка" Тогда
		ИмяОбработки = "Обработка.НастройкаИПросмотрИсторииДанных";
	Иначе
		ИмяОбработки = "ВнешняяОбработка.НастройкаИПросмотрИсторииДанных";		 
	КонецЕсли;
	
	Элементы.ДекорацияОбработано.Заголовок = "0/0";
	
	ИмяМетаданныхЕЧ = Параметры.ИмяМетаданныхЕЧ;
	ИмяМетаданных   = Параметры.ИмяМетаданных;
	Имя             = Параметры.Имя;
	
	ОбъектМетаданных = ИмяМетаданныхЕЧ + "." + Имя;
	
	// Определяем общее количество элементов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(1) КАК Количество
	|ИЗ
	|	" + ИмяМетаданныхЕЧ + "." + Имя + " КАК ТаблицаБД";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ОбщееКоличествоОбъектов =  Выборка.Количество;

	//Определяем общее количество версий
	
	//П = Новый Структура("Метаданные", Метаданные[ИмяМетаданных][Имя]);
	//
	//ТЗ = ИсторияДанных.ВыбратьВерсии(П, "НомерВерсии");
	//
	//ОбщееКоличествоВерсий = ТЗ.Количество();
	
	//Получаем все элементы
	ПолучитьОбъектыНаСервере();
	
	ЕстьНеудаленные = Истина;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьПервые100Версий(Команда)
	ПолучитьПервые100ВерсийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоВерсий(Команда)
	
	//МассивИдентификаторовСтрок = Элементы.ТаблицаОбъектов.ВыделенныеСтроки;
	//
	//Элементы.Прогресс.МинимальноеЗначение  = 0;
	//Элементы.Прогресс.МаксимальноеЗначение = МассивИдентификаторовСтрок.Количество();

	//Прогресс = 0;
	//Счетчик  = 0;
	//
	//ПрорцияМассивИдентификаторовСтрок = Новый Массив;
	//
	//Для Каждого Стр Из МассивИдентификаторовСтрок Цикл
	//	
	//	Счетчик = Счетчик + 1;
	//	
	//	Прогресс = Прогресс + 1;
	//	Элементы.ДекорацияОбработано.Заголовок = "" + Прогресс + "/" + МассивИдентификаторовСтрок.Количество();
	//	
	//	ПрорцияМассивИдентификаторовСтрок.Добавить(Стр);
	//	
	//	Если Счетчик = 1000 Тогда
	//		КоличествоВерсийНаСервере(ПрорцияМассивИдентификаторовСтрок);
	//		
	//		ПрорцияМассивИдентификаторовСтрок.Очистить();
	//		Счетчик = 0;
	//	КонецЕсли;
	//	
	//	ОбработкаПрерыванияПользователя();
	//	
	//КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВерсии(Команда)
	
	МассивИдентификаторовСтрок = Элементы.Версии.ВыделенныеСтроки;
	
	//Элементы.Прогресс.МинимальноеЗначение  = 0;
	//Элементы.Прогресс.МаксимальноеЗначение = МассивИдентификаторовСтрок.Количество();

	//Прогресс = 0;
	Для Каждого Стр Из МассивИдентификаторовСтрок Цикл
		
		//Прогресс = Прогресс + 1;
		Элементы.ДекорацияОбработано.Заголовок = "" + Прогресс + "/" + МассивИдентификаторовСтрок.Количество();
		
		ЭлементТО = Версии.НайтиПоИдентификатору(Стр);
		
		УдалитьВерсииОбъектаНаСервере(ЭлементТО.Данные);
		
		//ОбработкаПрерыванияПользователя();
		//Состояние(" " + ЭлементТО.Ссылка);
		
	КонецЦикла;

КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьПервые100ВерсийНаСервере()
	
	ОтборИсторииДанных = Новый Структура("Метаданные",  Метаданные.Документы.Сообщение);
	
	ТЗ = ИсторияДанных.ВыбратьВерсии(ОтборИсторииДанных,,,1);	
	
	Версии.Очистить();
	
	Для Каждого Стр Из ТЗ Цикл
		
		НоваяВерсия = Версии.Добавить();
			
		ЗаполнитьЗначенияСвойств(НоваяВерсия, Стр);
	КонецЦикла;
	
	Если Версии.Количество() = 0 Тогда
		ЕстьНеудаленные = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВерсииОбъектаНаСервере(Ссылка)
	
	ИсторияДанных.УдалитьВерсии(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	
	Для Каждого Стр Из Версии Цикл
		ИсторияДанных.УдалитьВерсии(Стр.Данные);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьОбъектыНаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ 
	//|	Ссылка КАК Ссылка
	//|ИЗ
	//|	" + ИмяМетаданныхЕЧ + "." + Имя + " КАК ТаблицаБД
	//|УПОРЯДОЧИТЬ ПО
	//|	ТаблицаБД.Дата";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	
	//	НовСтр = ТаблицаОбъектов.Добавить();
	//	НовСтр.Ссылка = Выборка.Ссылка;
	//	
	//КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ВерсииОбъектаНаСервере()

	
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсииОбъекта(Команда)
	//ВерсииОбъектаНаСервере();
	
	
	//	
	П = Новый Структура("Ссылка", Элементы.ТаблицаОбъектов.ТекущиеДанные.Ссылка);
	ОткрытьФорму(ИмяОбработки + ".Форма.ФормаСпискаВерсий", П);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеВерсии(Команда)
	
	Прогресс = 0;
	
	Элементы.ДекорацияОбработано.Заголовок = "" + Прогресс + "/" + 270000;	
	Состояние("" + Прогресс + "/" + 270000);
	
	Пока ЕстьНеудаленные Цикл
		ПолучитьПервые100ВерсийНаСервере();
		УдалитьНаСервере();
		Прогресс = Прогресс + 100;
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
КонецПроцедуры








#КонецОбласти






